{"content":"\"### The Body-Mass Index (BMI)\\n\\nThe body-mass-index (BMI) depends on the height and weight of the participant. These two values for each participant do exist in DEAP. We can get these values by calling the `use`-function. As a return value we receive a list of promises that are fulfilled once all the data arrives.\\n```\\nvar promises = use([\\\"anthro_weight_calc\\\", \\\"anthro_height_calc\\\"]);\\n```\\n\\nThe BMI can be calculated using the following formula - assuming pounds as units for weight ($w$) and inches as units for height ($h$): $$703 \\\\frac{w}{h^2}$$\\n\\nWe can implement this calculation in a function called `calc` that gets two arguments, the weight of a participant in `w` and the height of a participant in `h`. The function then returns the calculated values.\\n```\\nfunction calc(w, h) {\\n     return w\/(h*h) * 703;\\n}\\n```\\n\\nNow we wait until the promises have been resolved, which indicates that the weight and height values are available. At this point we can get the data and compute the new variable `anthro_weight_calc` using map. The map function computes for each row of the \\ndata spreadsheet the value of the new variable. It is sufficient to row.set the new value to have it show up in the histogram and table of this variable:\\n```\\njQuery.when(...promises).then( function() {\\n    var data = new DataFrame(allMeasures);\\n    data = data.map(row => row.set('bmi_calc_example', +calc(row.get('anthro_weight_calc'), row.get('anthro_height_calc')).toFixed(3)));\\n    update(data, 'bmi_calc_example');\\n});\\n```\\nAfter calculating the new values we need to call the `update` function to ensure that the table and histogram views update for our new variable. Press the Save button in order to store your work permanently on the system. At this point the values assigned to the new variable will be accessible for statistical analysis.\\n\"","permission":"public","name":"bmi_calc_example","description":"The body mass index calculated from the height and weight variables given in pounds."}